Revit 2027 API
BuiltInFailures.RebarFailures.NoElementsToEditConstraints Property
 There is no Rebar to edit constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoElementsToEditConstraints { get; }
Public Shared ReadOnly Property NoElementsToEditConstraints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoElementsToEditConstraints {
	FailureDefinitionId^ get ();
}
static member NoElementsToEditConstraints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace